// 1. Запитайте у юзера скільки йому років: «Привіт мені - “” років!»

// let age = prompt('Скільки Вам років?');
// alert(`Привіт мені - ${age} років!`);



// 2. Запитайтесь якого року народження юзер, теперішній рік візьмемо за константу. Виведемо скільки йому років.

// let year = 2020;
// let dateOfBirth = +prompt('Введіть ваш рік народження');
// alert(`Вам  ${year - dateOfBirth} років!`);



//3. Запитайтесь у юзера довжини сторін прямокутника та виведіть його периметр.

// let sideA = +prompt('Вкажіть сторону a');
// let sideB = +prompt('Вкажіть сторону b');
// let sideC = +prompt('Вкажіть сторону c');
// let sideD = +prompt('Вкажіть сторону d');
// alert(`Периметр дорівнює ${sideA + sideB + sideC + sideD }`);



// 4. Запитайтесь в юзера радіус кола та виведіть його площу.(число пі)

// const pi = 3.14;
// let radius = +prompt('Введіть радіус кола');
// alert(2 * pi * radius);



// 5. Водій їде з середньою швидкістю 50 км в годину. Запитайтесь у нього скільки ще йому необхідно часу їхати, та виведіть відстань. 

// let speed = 50;
// let time = prompt('Скільки часу Вам ще треба їхати?');
// let distance = speed * time;
// alert(`Залишилось проїхати ${distance} км.`);



// 6. Реалізуємо конвертер кілометрів в милі і навпаки =)

// let distanceKm = prompt('Конвертор величин. Щоб отримати відстань в милях, введіть відстань в кілометрах');
// let distanceMl = distanceKm * 1.609344;
// alert(`${distanceMl} миль`);

// let distanceMl = prompt('Конвертор величин. Щоб отримати відстань в кілометрах, введіть відстань в милях');
// let distanceKm = distanceMl / 1.609344;
// alert(`${distanceKm} кілометрів`);



// 7. Юзер вводить скільки коштів на його картці та ціну одного літра бензину. Виводимо скільки бензину він може купити та скільки грошей у нього залишиться.

// let money = prompt('Скільки грошей ви маєте?');
// let priceOfGas = prompt('Скільки коштує літр бензину?');
// let numberOfGas = money / priceOfGas;
// let restMoney = money - (priceOfGas * numberOfGas);
// alert(`Ви можете купити ${numberOfGas} бензину і у Вас залишиться ${restMoney} грн.`);